import { AboutSection } from "@/src/types/about-us/about-us";

export const visionMissionData = [
    {
      title: "الرسالة",
      items: [
        "نشر الوعي بأفكاري الريادية الماضيه في المجتمع الخليجي",
        "توفير الدعم الشامل المرافق من دعم مالي وخبرة فنية وإدارية",
        "الاسهام فى محاربة البطالة",
        "الاسهام في تنمية وتطوير المجتمع",
        "تحويل مفاهيم الريادة إلى الاعمال وتطوير الاعمال الحديثة القائمة",
        "العمل على تجاوز العناصر المساهمة والعقبات والمعلقة اساس عملية القدرة",
        "الطلاب عند خروج وتخرجه من المؤسسة تعتبر له استعداده كافة وتمهد له طريقة"
      ]
    },
    {
      title: "أهداف المؤسسة",
      items: [
        "نشر الوعي بأفكاري الريادية الماضيه في المجتمع الخليجي",
        "الخبرات التطبيقية والثقافية وادارة المشاريع وخبرات الكبار",
        "التعريف المستمر للمفاهيم وتعارات المعوقات ممكنة الانتاج",
        "السعي على تقديم خدمات التدريب المناسب للمشروعات",
        "المساعدة في مناقشة وتحليل الشركة"
      ]
    }
  ];

export  const valuesData: AboutSection[] = [
    {
      title: "المرجعية العلمية",
      content: "نحن نؤمن بالبحث والتطوير المستمر والبناء على الأسس العلمية والمعرفية لخلق ثقافة راسخة والارتقاء بمهارات العمل"
    },
    {
      title: "الشمولية",
      content: "نحن نؤمن بالبحث والتطوير المستمر والبناء على الأسس العلمية والمعرفية لخلق ثقافة راسخة والارتقاء بمهارات العمل"
    },
    {
      title: "الديمقراطية العلمية",
      content: "نحن نؤمن بالبحث والتطوير المستمر والبناء على الأسس العلمية والمعرفية لخلق ثقافة راسخة والارتقاء بمهارات العمل"
    },
    {
      title: "الحماية",
      content: "نحن نؤمن بالبحث والتطوير المستمر والبناء على الأسس العلمية والمعرفية لخلق ثقافة راسخة والارتقاء بمهارات العمل"
    },
    {
      title: "المرجعية العلمية",
      content: "نحن نؤمن بالبحث والتطوير المستمر والبناء على الأسس العلمية والمعرفية لخلق ثقافة راسخة والارتقاء بمهارات العمل"
    },
    {
      title: "المرجعية العلمية",
      content: "نحن نؤمن بالبحث والتطوير المستمر والبناء على الأسس العلمية والمعرفية لخلق ثقافة راسخة والارتقاء بمهارات العمل"
    }
  ];

export  const accordionItems = [
    "السياسات الخصوصية",
    "السياسات العامة",
    "حقوق الملكية",
    "الحوكمة المؤسسات",
    "الحوكمة المؤسسات"
  ];
