import { AboutSection } from "@/src/types/about-us/about-us";

export const visionMissionData = [
    {
      title: "الرسالة",
      items: [
        "توجيه الباحث بدقة وكفاءة في جميع مراحل العمل البحثي، وصقل مهارات المتدربين لتعزيز قدراتهم البحثية والمهنية والتفكير الإبداعي والنقدي.",
      ]
    },
    {
      title: "أهداف المؤسسة",
      items: [
        "نشر الوعي بأفكاري الريادية الماضيه في المجتمع الخليجي",
        "الخبرات التطبيقية والثقافية وادارة المشاريع وخبرات الكبار",
        "التعريف المستمر للمفاهيم وتعارات المعوقات ممكنة الانتاج",
        "السعي على تقديم خدمات التدريب المناسب للمشروعات",
        "المساعدة في مناقشة وتحليل الشركة"
      ]
    }
  ];

export  const valuesData: AboutSection[] = [
    {
      title: "المرونة والدعم المستمر",
      content: "تتميز العلوم الإنسانية بتقديم دعم أكاديمي مرن يلائم احتياجات باحث الدراسات العليا في مختلف المراحل البحثية، عبر قنوات تواصل متعددة وسريعة الاستجابة؛ كما نحرص على تواجد مستشارينا بشكل دائم لتقديم التوجيه الفوري والإجابة على الاستفسارات الأكاديمية، مع متابعة مستمرة لضمان تحقيق التقدّم العلمي وفق جدول الباحث وظروفه، بما يضمن له تجربة بحثية مريحة، فعّالة، وخالية من التعقيدات."
    },
    {
      title: "عقود وضمانات واضحة",
      content: "نلتزم في المنصة بإبرام عقد رسمي لكل طلب خدمة يتم توقيعه بين العميل والمنصة، يوضّح فيه نطاق العمل ومتطلباته ومراحله وآلية التنفيذ بوضوح وشفافية؛ ويهدف هذا التعاقد إلى ضمان حقوق الطرفين وتحديد المسؤوليات بدقة، بما يعزز الثقة والمصداقية في التعامل، ويضمن سير العمل وفق خطة واضحة ومحددة من البداية حتى تسليم الخدمة النهائية بأعلى مستويات الجودة والالتزام المهني."
    },
    {
      title: "خصوصية وأمان بنسبة (100%)",
      content: "نتمسك بشدة بالحماية الشاملة لبيانات وملفات العملاء وعدم مشاركتها مع أي طرف ثالث، مع صلاحيات وصول محدودة للفريق المختص فقط."
    },
    {
      title: "التزام قانوني وحقوقي",
      content: "نحترام حقوق الملكية الفكرية للباحث طالب الخدمة وفق أنظمة الهيئة السعودية للملكية الفكرية (SAIP) وإصدار فواتير إلكترونية متوافقة مع لوائح هيئة الزكاة والضريبة والجمارك (ZATCA)."
    },
    {
      title: "خبراء في تخصصك الدقيق",
      content: "نحرص على إسناد كل باحث أو متدرب إلى استشاري أو مدرب متخصص في نفس مجاله الدقيق، لضمان فهم عميق لموضوع البحث واحتياجاته الأكاديمية؛ ويتم اختيار الخبراء بعناية بناءً على خبراتهم العملية والعلمية في المجال نفسه، مما يضمن تقديم دعم موجه ودقيق يعزز جودة المخرجات البحثية ويحقق أفضل النتائج بأعلى درجات الاحترافية."
    },
    {
      title: "خيارات تدريب مرنة",
      content: "تتضمن المنصة دورات مسجّلة يمكن متابعتها في أي وقت ومن أي مكان، بما يتيح للمتدرب التعلم وفق وتيرته الخاصة، إلى جانب دورات بث مباشر تُعقد في مواعيد مُعلنة مسبقًا تتيح التفاعل المباشر مع المدرب وطرح الأسئلة ومناقشة الأفكار في بيئة تعليمية تفاعلية؛ كما نوفر إمكانية إعادة مشاهدة الجلسات ومتابعة التحديثات أولًا بأول، لضمان تجربة تدريبية مرنة ومستمرة تراعي وقت المتدرب وتدعمه في تحقيق أهدافه العلمية والمهنية بأعلى كفاءة."
    },
    {
      title: "تجربة دفع ميسّرة",
      content: "نوفّر لعملائنا تجربة دفع آمنة وسهلة تتناسب مع أحدث التقنيات المالية المعتمدة حيث نقبل جميع وسائل الدفع الإلكترونية الموثوقة مثل (مدى، فيزا، ماستركارد) وغيرها من المحافظ الرقمية المعتمدة داخل المملكة، كما نتيح خيار التحويل البنكي المباشر من الحسابات المحلية عبر البنوك السعودية المعروفة."
    }
];

export  const accordionItems = [
    "السياسات الخصوصية",
    "السياسات العامة",
    "حقوق الملكية",
    "الحوكمة المؤسسات",
    "الحوكمة المؤسسات"
  ];
