import { FAQ } from "@/src/types/FAQ/FAQ";

// Combined FAQs from both Academic Consultations and Training Courses
export const faqs: FAQ[] = [
  // Academic Consultations FAQs
  {
    id: 1,
    questionType: "الإستشارات الأكاديمية",
    questionText: "هل المنصة نظامية قانونياً؟ لها سجل تجاري؟ وأوراق رسمية تضمن الالتزام بالخدمات المُقدمة؟",
    questionAnswer: "نعم  بوابة العلوم الإنسانية هي شركة سعودية نظامية رقم (7051951767) تُقدم الإرشاد الأكاديمي والدورات (التدريبية -التطويرية - المهنية) وإقامة المؤتمرات العلمية وغيرها الكثير من الخدمات التعليمية والتطويرية",
  },
  {
    id: 2,
    questionType: "الإستشارات الأكاديمية",
    questionText: "هل يمكن تقديم استشارة عاجلة للضرورة؟",
    questionAnswer: "نعم في بوابة العلوم الإنسانية تتوفر خدمة تقديم الاستشارات في أقل من 24 ساعة مع المختص في مجالك",
  },
  {
    id: 3,
    questionType: "الإستشارات الأكاديمية",
    questionText: "هل تضمن الاستشارة تفصيل لنقاط القوة والضعف في بحثي أو دراستي؟",
    questionAnswer: "في بوابة العلوم الإنسانية ... نعم نقدم لك تقرير تفصيلي يتضمن نقاط القوة والضعف مع التوصيات والملاحظات التي تُثري البحث",
  },
  {
    id: 4,
    questionType: "الإستشارات الأكاديمية",
    questionText: "كيف تضمن المنصة حفظ خصوصية العملاء وأعمالهم؟",
    questionAnswer: "تولي بوابة العلوم الإنسانية خصوصية تامة للعملاء وأعمالهم حيث يتم حفظ جميع الملفات والمراسلات في أنظمة مؤمنة بتقنيات تشفير متقدمة، ولا يتم مشاركتها مع أي طرف ثالث تحت أي ظرف؛ ولا يُسمح بالوصول إلى البيانات إلا فقط للفريق المختص وبالقدر اللازم لتقديم الخدمة ليس أكثر، مما يضمن سرية تامة وأمانًا كاملًا لجميع العملاء.",
  },
  {
    id: 5,
    questionType: "الإستشارات الأكاديمية",
    questionText: "ماهي ضمانات حقوق الملكية الفكرية للباحث؟",
    questionAnswer: "تلتزم المنصة بحماية حقوق الملكية الفكرية لجميع الأعمال الأكاديمية وذلك وفق أنظمة الهيئة السعودية للملكية الفكرية (SAIP).؛ وتعد تلك الأعمال حقوقًا حصرية للعميل ويُمنع منعًا باتًا استخدامها أو تداولها أو نشرها أو إعادة استخدامها أو تسليمها لأي طرف آخر دون موافقة خطية مسبقة من العميل صاحب الحق لضمان بيئة أكاديمية آمنة تحترم جهود الباحثين وتحفظ نتاجهم العلمي.",
  },
  {
    id: 6,
    questionType: "الإستشارات الأكاديمية",
    questionText: "هل يمكنني الحصول على فاتورة أو إيصال بعد الدفع؟",
    questionAnswer: "نعم بالتأكيد يمكنك الحصول على فاتورة إلكترونية وفق لوائح وأنظمة هيئة الزكاة والضريبة والجمارك السعودية  (ZATCA) وتتأكد من صحة الفاتورة من خلال الرقم التعريفي للهيئة ويُصدر لك منها رمز (QR) لكل فاتورة.",
  },
  {
    id: 7,
    questionType: "الإستشارات الأكاديمية",
    questionText: "هل أجد مستشار أكاديمي في تخصصي الدقيق؟",
    questionAnswer: "تلتزم بوابة العلوم الإنسانية بتوفير مستشارك الأكاديمي في نفس تخصصك الدقيق لضمان تنفيذ المهام بدقة ومصداقية، وتحقيق أفضل النتائج بما يواكب تطلعات العميل ويعكس التزام المنصة بالتميز والجودة في كل مرحلة من مراحل العمل.",
  },
  {
    id: 8,
    questionType: "الإستشارات الأكاديمية",
    questionText: "هل تظل بيانتي ومعلوماتي على المنصة بعد الانتهاء تقديم الخدمة؟",
    questionAnswer: "يحق للعميل في أي وقت طلب حذف بياناته ومعلوماته عقب اكتمال الخدمة أو في حال عدم إتمام الاتفاق، وتلتزم المنصة بإصدار إشعار رسمي يؤكد حذف جميع البيانات والسجلات ذات الصلة بشكل آمن ونهائي، بما يضمن أعلى معايير السرية والامتثال للأنظمة المعمول بها في المملكة العربية السعودية.",
  },
  {
    id: 9,
    questionType: "الإستشارات الأكاديمية",
    questionText: "ما هي طرق الدفع لديكم؟",
    questionAnswer: "نقبل جميع وسائل الدفع المتنوعة والأيسر للعميل",
  },
  {
    id: 10,
    questionType: "الإستشارات الأكاديمية",
    questionText: "هل تتيح المنصة الاطلاع على نماذج أعمال سابقة؟",
    questionAnswer: "لا يمكن لأنه ضد سياسات الخصوصية والتي تنص على عدم تداول أو عرض أي من أعمال العملاء السابقين.",
  },
  {
    id: 11,
    questionType: "الإستشارات الأكاديمية",
    questionText: "سؤال غير ما سبق",
    questionAnswer: "تواصل معنا في أي وقت",
  },
  // Training Courses FAQs
  {
    id: 12,
    questionType: "الدورات التدريبية",
    questionText: "هل المنصة نظامية قانونياً؟ لها سجل تجاري؟ وأوراق رسمية تضمن الالتزام بالخدمات المُقدمة؟",
    questionAnswer: "نعم  بوابة العلوم الإنسانية هي شركة سعودية نظامية رقم (7051951767) تُقدم الإرشاد الأكاديمي والدورات (التدريبية -التطويرية - المهنية) وإقامة المؤتمرات العلمية وغيرها الكثير من الخدمات التعليمية والتطويرية",
  },
  {
    id: 13,
    questionType: "الدورات التدريبية",
    questionText: "متى أحصل على محتوى الدورة؟",
    questionAnswer: "بعد إتمام عملية الدفع مباشرة، تجد الدورة في حسابك على منصة بوابة العلوم الإنسانية",
  },
  {
    id: 14,
    questionType: "الدورات التدريبية",
    questionText: "هل الدورات بث مباشر أو مسجلة؟",
    questionAnswer: "في منصة بوابة العلوم الإنسانية، هناك نوعان من الدورات\n\n- دورات مسجلة مسبقًا يمكنك مشاهدتها في أي وقت يناسبك.\n\n- دورات تُقدَّم بالبث المباشر في مواعيد محددة يتم الإعلان عنها مسبقًا.",
  },
  {
    id: 15,
    questionType: "الدورات التدريبية",
    questionText: "هل أستطيع توجيه سؤال للمدرب؟",
    questionAnswer: "نعم إذا كانت الدورة من الدورات التي يتم بثها مباشرة يمكنك كتابة سؤالك نصياً أو التفاعل المباشر مع المُدرب.",
  },
  {
    id: 16,
    questionType: "الدورات التدريبية",
    questionText: "هل أستطيع تحميل الدورة على جهازي؟",
    questionAnswer: "لا يمكنك تحميل الدورات على جهازك يمكنك مشاهدة الدورات أونلاين إذا كانت دورة مُسجلة.",
  },
  {
    id: 17,
    questionType: "الدورات التدريبية",
    questionText: "ماذا إذا تمكنت من تحميل الدورة على جهازي من خلال برمجيات خاصة؟",
    questionAnswer: "ستتعرض للمسائلة القانونية لأن الفيديوهات محمية من خلال حقوق الملكية الفكرية ونؤكد لك أن برمجة منصة بوابة العلوم الإنسانية ترسل إشعارات فورية لأي محاولات لتحميل الدورات المُسجلة من أي دولة في العالم.",
  },
  {
    id: 18,
    questionType: "الدورات التدريبية",
    questionText: "هل سأحصل على شهادة بعد الانتهاء من الدورة؟",
    questionAnswer: "نعم بعد إكمال كامل الدورة إذا كانت بث مُباشر أو دفع تكلفتها إذا كانت مُسجلة ستحصل على شهادة حضور من بوابة العلوم الإنسانية ويتم إضافتها لحسابك في المنصة مباشرة.",
  },
  {
    id: 19,
    questionType: "الدورات التدريبية",
    questionText: "هل شهادات بوابة العلوم الإنسانية معتمدة من الجهات الحكومية؟",
    questionAnswer: "الشهادات معتمدة من الجهات الحكومية الرسمية بجمهورية مصر العربية، وجاري الاعتماد من الجهات الحكومية بالمملكة بمجرد فتح باب الاعتمادات لأن \"الفترة الحالية\" الاعتمادات مُعلقة بسبب تعديل بعض اللوائح القانونية.",
  },
  {
    id: 20,
    questionType: "الدورات التدريبية",
    questionText: "هل يمكنني الحصول على فاتورة أو إيصال بعد الدفع؟",
    questionAnswer: "نعم بالتأكيد يمكنك الحصول على فاتورة إلكترونية وفق لوائح وأنظمة هيئة الزكاة والضريبة والجمارك السعودية  (ZATCA) وتتأكد من صحة الفاتورة من خلال الرقم التعريفي للهيئة ويُصدر لك منها رمز (QR) لكل فاتورة.",
  },
  {
    id: 21,
    questionType: "الدورات التدريبية",
    questionText: "من هم المدربون في المنصة؟",
    questionAnswer: "في بوابة العلوم الإنسانية جميع المُدربين بلا استثناء مُدربين متخصصين ومُعتمدين ويتم تقديم فيديو تعريفي بالمُدرب وتعريف بالدورة قبل الإشتراك فيها ودفع تكلفتها.",
  },
  {
    id: 22,
    questionType: "الدورات التدريبية",
    questionText: "سؤال غير ما سبق",
    questionAnswer: "تواصل معنا في أي وقت",
  },
];