import { Testimonial } from "@/src/types/testmonial/testmonial";

export const testimonials: Testimonial[] = [
  {
    id: 1,
    name: "أحمد محمد",
    title: "دكتور أسنان",
    image: "/imgs/testmonial.png",
    rating: 5,
    text: "التجربة كانت مميزة جداً، الفريح واضح والخدمات منظمة. استفدت من التطبيق العملي وبصدق إن مستوى التحسن، شكراً على الجهود الكبيرة."
  },
  {
    id: 2,
    name: "أحمد محمد",
    title: "دكتور أسنان",
    image: "/imgs/testmonial.png",
    rating: 5,
    text: "التجربة كانت مميزة جداً، الفريح واضح والخدمات منظمة. استفدت من التطبيق العملي وبصدق إن مستوى التحسن، شكراً على الجهود الكبيرة."
  },
  {
    id: 3,
    name: "أحمد محمد",
    title: "دكتور أسنان",
    image: "/imgs/testmonial.png",
    rating: 5,
    text: "التجربة كانت مميزة جداً، الفريح واضح والخدمات منظمة. استفدت من التطبيق العملي وبصدق إن مستوى التحسن، شكراً على الجهود الكبيرة."
  },
  {
    id: 4,
    name: "أحمد محمد",
    title: "دكتور أسنان",
    image: "/imgs/testmonial.png",
    rating: 5,
    text: "التجربة كانت مميزة جداً، الفريح واضح والخدمات منظمة. استفدت من التطبيق العملي وبصدق إن مستوى التحسن، شكراً على الجهود الكبيرة."
  },
  {
    id: 5,
    name: "أحمد محمد",
    title: "دكتور أسنان",
    image: "/imgs/testmonial.png",
    rating: 5,
    text: "التجربة كانت مميزة جداً، الفريح واضح والخدمات منظمة. استفدت من التطبيق العملي وبصدق إن مستوى التحسن، شكراً على الجهود الكبيرة."
  }
];