export const filters = [
  "التخطيط والتهيئة البحثية",
  "الدراسات النظرية والإطار المفاهيمي",
  "التحليل البحثي وتفسير النتائج",
  "الصياغة الأكاديمية والتحرير العلمي",
  "المراجعة النهائية والدعم الأكاديمي",
];

export const CourseFilters = [
  "نظام إدارة التعلم",
  "تصميم دليل المُدرب والمٌتدرب",
  "	تصميم البرامج التدريبية ",
  "التدريب الذاتي",
  " استشارات تدريبية",
  "تصميم محتوى تعليمي تفاعلي ",
  "الدورات التدريبية الإلكترونية",
];

export const profileCourseFilters = [
  "كل الدورات ",
  "الدوارات المكتملة",
  "الدوارات الغير المكتملة",
  "المفضلة",
  "الشهادات",
];
export const Questionsfilters = ["الإستشارات الأكاديمية", "الدورات التدريبية"];
