import { Service } from "@/src/types/services/services";

export const services:Service[] = [
    {
        "title": "خدمات المراجعة النهائية والدعم الأكاديمي",
        "description": "نراجع رسالتك بعناية لضمان خلوها من الأخطاء اللغوية والإملائية،   لتظهر بصورة احترافية تليق ",
        "link_text": "أعرف المزيد"
    },
    {
        "title": "خدمات المراجعة النهائية والدعم الأكاديمي",
        "description": "نراجع رسالتك بعناية لضمان خلوها من الأخطاء اللغوية والإملائية،   لتظهر بصورة احترافية تليق ",
        "link_text": "أعرف المزيد"
    },
    {
        "title": "خدمات المراجعة النهائية والدعم الأكاديمي",
        "description": "نراجع رسالتك بعناية لضمان خلوها من الأخطاء اللغوية والإملائية،   لتظهر بصورة احترافية تليق ",
        "link_text": "أعرف المزيد"
    },
    {
        "title": "خدمات المراجعة النهائية والدعم الأكاديمي",
        "description": "نراجع رسالتك بعناية لضمان خلوها من الأخطاء اللغوية والإملائية،   لتظهر بصورة احترافية تليق ",
       
        "link_text": "أعرف المزيد"
    }
]