import { BoxComponentProps } from "@/src/types/BoxComponentTypes/BoxComponentTypes";

export const Represntations: BoxComponentProps[] = [
  {
    title: "خدمات الإرشاد الأكاديمي",
    description:
      "نرافقك في رحلتك الأكاديمية بخدمات متكاملة تساعدك على إعداد بحثك العلمي بأعلى معايير الجودة والدقة.",
    icon: (
      <svg
        width="56"
        height="56"
        viewBox="0 0 56 56"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M49.98 25.4848C50.3977 25.3006 50.7522 24.9978 50.9995 24.6141C51.2469 24.2303 51.3762 23.7824 51.3714 23.3259C51.3667 22.8694 51.2282 22.4243 50.973 22.0457C50.7178 21.6672 50.3571 21.3718 49.9357 21.1962L29.9367 12.0868C29.3287 11.8095 28.6683 11.666 28 11.666C27.3318 11.666 26.6713 11.8095 26.0634 12.0868L6.06668 21.1868C5.65128 21.3688 5.29789 21.6678 5.04974 22.0474C4.80159 22.427 4.66943 22.8707 4.66943 23.3242C4.66943 23.7777 4.80159 24.2214 5.04974 24.6009C5.29789 24.9805 5.65128 25.2796 6.06668 25.4615L26.0634 34.5802C26.6713 34.8575 27.3318 35.001 28 35.001C28.6683 35.001 29.3287 34.8575 29.9367 34.5802L49.98 25.4848Z"
          stroke="#18181B"
          strokeWidth="3"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
        <path
          d="M51.3334 23.3335V37.3335"
          stroke="#39A975"
          strokeWidth="3"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
        <path
          d="M14 29.1665V37.3332C14 39.1897 15.475 40.9702 18.1005 42.2829C20.726 43.5957 24.287 44.3332 28 44.3332C31.713 44.3332 35.274 43.5957 37.8995 42.2829C40.525 40.9702 42 39.1897 42 37.3332V29.1665"
          stroke="#18181B"
          strokeWidth="3"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),

    footer: "اعرف المزيد",
  },

  {
    title: "خدمات التدريب",
    description:
      "نرافقك في رحلتك الأكاديمية بخدمات متكاملة تساعدك على إعداد بحثك العلمي بأعلى معايير الجودة والدقة.",
    icon: (
      <svg
        width="56"
        height="56"
        viewBox="0 0 56 56"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M28 49.0002V16.3335"
          stroke="#18181B"
          strokeWidth="2"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
        <path
          d="M37.3333 28.0002L42 32.6668L51.3333 23.3335"
          stroke="#39A975"
          strokeWidth="3"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
        <path
          d="M51.3334 14V9.33333C51.3334 8.71449 51.0875 8.121 50.6499 7.68342C50.2124 7.24583 49.6189 7 49 7H37.3334C34.858 7 32.484 7.98333 30.7337 9.73367C28.9834 11.484 28 13.858 28 16.3333C28 13.858 27.0167 11.484 25.2664 9.73367C23.516 7.98333 21.142 7 18.6667 7H7.00002C6.38118 7 5.78769 7.24583 5.3501 7.68342C4.91252 8.121 4.66669 8.71449 4.66669 9.33333V39.6667C4.66669 40.2855 4.91252 40.879 5.3501 41.3166C5.78769 41.7542 6.38118 42 7.00002 42H21C22.8565 42 24.637 42.7375 25.9498 44.0503C27.2625 45.363 28 47.1435 28 49C28 47.1435 28.7375 45.363 30.0503 44.0503C31.363 42.7375 33.1435 42 35 42H49C49.6189 42 50.2124 41.7542 50.6499 41.3166C51.0875 40.879 51.3334 40.2855 51.3334 39.6667V36.6333"
          stroke="#18181B"
          strokeWidth="3"
          strokeLinecap="round"
          strokeLinejoin="round"
        />
      </svg>
    ),
    footer: "اعرف المزيد",
  },
];
